@jhutchings1, 
it's still the case on "free" plans. After importing an existing domain, `tf show` displays this state:

```
# cloudflare_zone_subscription.this["__myzone___"]:
resource "cloudflare_zone_subscription" "this" {
    currency  = "USD"
    frequency = "not-applicable"
    id        = "zone_id"
    price     = 0
    rate_plan = {
        currency           = "USD"
        externally_managed = false
        id                 = "free"
        is_contract        = false
        public_name        = "Cloudflare Free Plan"
        scope              = "zone"
    }
    state     = "Paid"
    zone_id   = "zone_id"
}    
```

note `not-applicable` under `frequency`. That value isn't allowed, and setting it to `null` triggers resource update for multiple fields:

```tf
resource "cloudflare_zone_subscription" "this" {
  for_each = cloudflare_zone.this

  zone_id   = each.value.id
  frequency = null # "not-applicable"

  rate_plan = {
    id                 = "free"
    currency           = "USD"
    externally_managed = false
    is_contract        = false
    public_name        = "Cloudflare Free Plan"
    scope              = "zone"
  }
}
```

```
  # cloudflare_zone_subscription.this["__myzone___"] will be updated in-place
  ~ resource "cloudflare_zone_subscription" "this" {
      ~ currency             = "USD" -> (known after apply)
      + current_period_end   = (known after apply)
      + current_period_start = (known after apply)
      - frequency            = "not-applicable" -> null
        id                   = "zone_id"
      ~ price                = 0 -> (known after apply)
      ~ state                = "Paid" -> (known after apply)
        # (2 unchanged attributes hidden)
    }
```


Using the latest version:
```
terraform version
OpenTofu v1.10.5
on darwin_arm64
+ provider registry.opentofu.org/cloudflare/cloudflare v5.8.2
```

